{
  "folder": "81lpHPvcOeOkc8gf",
  "name": "Items",
  "_id": "s8DAOTe8r1s1TE7k",
  "pages": [
    {
      "sort": 100000,
      "name": "Items",
      "type": "text",
      "_id": "3cfgP1fZ6XPrvCmF",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>There are multiple types of items.</p><p></p><h1>Carried Items</h1><p>These are physical items that can be carried by Travellers and NPCs. They have a weight and to an actor's encumbrance.</p><p>Each carried item has a Tech Level, Cost and Weight.</p><p>Such items have three possible states on the actor sheet:</p><p><strong>Active</strong> - Worn or held in the hand. These are ready to be used.</p><p><strong>Carried</strong> - Being carried, but not in use.</p><p><strong>Stored</strong> - These are owned by the Traveller, but not currently 'at hand'.</p><p></p><p></p><h2>Weapon</h2><p>Weapons appear in the list of attack items. Weapons have a scale, which is either Traveller, Vehicle or Starship. This affects what type of actor can use it.</p><p>Weapons can have traits, which may have an effect on the attack. The following traits are currently supported:</p><p><strong>AP</strong>, <strong>Auto</strong>, <strong>Blast</strong>, <strong>Bulky</strong>, Destructive, LaserSight, <strong>Lo-Pen</strong>, <strong>Radiation</strong>, Scope, Smart, <strong>Stun</strong>, <strong>VeryBulky</strong>, Zero-G</p><p>The ones listed in bold have automated support. The others are currently just informational.</p><h2>Armour</h2><p>Armour adds a to an actor's ability to resist damage. Normally, only one item or armour can be worn at a time. Wearing an item of armour when one is already being worn will move the other to 'carried'.</p><p>Armour has a protection and a 'other protection' score. The latter is added to the base protection if the attack type of the weapon (laser, energy, fire) matches one of the energy types listed for the armour.</p><p></p><h2>Augmentation</h2><p>Augmentations give bonuses to an actor, in the form of bonuses to characteristics or skills. They are normally cyberware or biological implants or drugs. There are several types, which vary by how they add bonuses.</p><h3>Skill and Characteristic Effects</h3><p><strong>Augment</strong> - Increases a characteristic or skill by the given value. The character must already have the skill at 0 for an augment to work.</p><p><strong>DM</strong> - Adds a bonus or penalty to rolls involving the characteristic or skill. The bonus applies regardless of the skill level of the character.</p><p><strong>Boon / Bane</strong> - Causes rolls for this characteristic or skill to be rolled with a boon or a bane.</p><p><strong>Expert Program</strong> - Follows the rules of expert software. Level X gives a skill level of X-1.</p><p><strong>Min</strong> - Sets the minimum value for a characteristic. Applied after Augment bonus.</p><h3>Other Effects</h3><p><strong>Carry Multiplier</strong> - Increases the multiple of how much the character can carry. A value of +1 will double max load (x1 -&gt; x2).</p><p><strong>Encumbrance DM</strong> - Usually a penalty, applied to all physical skill checks.</p><p><strong>Physical DM</strong> - Applied to physical skill checks</p><p><strong>Melee DM</strong> - Applied to attacks with Melee skills. It does not apply to pure skill checks.</p><p><strong>Gun Combat DM</strong> - Provides a bonus to gun skills when making an attack. It does not apply to pure skill checks.</p><p></p><p></p><p></p><h3>General Items</h3><p>Everything else. General Items don't have any game effect other than having a weight and cost.</p><p></p><h1>Spacecraft Items</h1><p></p><h2>Cargo</h2><p>Freight which can be traded and sold. Cargo can have purchase and sale DMs applied to it, which is not currently used. There are plans to implement the trade system, at which point these will become useful.</p><p>Cargo can only be added to spacecraft actor sheets.</p><p></p><h2>Hardware</h2><p>Spacecraft hardware, such as jump drives, weapons and power systems. Hardware can only be added to spacecraft actor sheets.</p><p></p><h1>Meta Items</h1><p>Such items represent things on the character sheet, but aren't physical things in the world.</p><p></p><h2>Term</h2><p>A career term during character generation.</p><p></p><h2>Associate</h2><p>An ally, enemy, contact or rival that is gained during character generation.</p><p></p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1,
        "Uzw5MJmM0BRE3sSL": 3
      },
      "flags": {},
      "_stats": {
        "systemId": "mgt2e",
        "systemVersion": "0.10.0",
        "coreVersion": "12.331",
        "createdTime": 1717860730537,
        "modifiedTime": 1744478165595,
        "lastModifiedBy": "mhUjqDVicnwIUaiq",
        "compendiumSource": null,
        "duplicateSource": null
      },
      "_key": "!journal.pages!s8DAOTe8r1s1TE7k.3cfgP1fZ6XPrvCmF"
    },
    {
      "sort": 200000,
      "name": "Weapons",
      "type": "text",
      "_id": "atkiDLVflVo0A6qx",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>Weapons are a special type of item, and each weapon can have one or more traits applied to them. The following weapon traits have rules implemented to handle them automatically.</p><h2>Traits</h2><h3>AP (X)</h3><p>Reduces the protective value of the target's armour.</p><h3>Auto (X)</h3><p>Automatic weapon. Allows weapons to be fired in burst or full auto mode when an attack is made, either making multiple attacks or giving a bonus to damage. Ammunition is reduced by the auto value.</p><h3>Blast (X)</h3><p>Causes blast damage. If the damage value is dragged to a map, then the blast area of effect will be displayed on the map. There are system options to apply a 'jitter' to the location if the attack misses.</p><h3>Bulky</h3><p>Gives a penalty to attack rolls if Traveller's strength is &lt; 9.</p><h3>Dangerous</h3><p>A message will be output if the weapon explodes.</p><h3>Destructive</h3><p>Multiplies the damage (and effect) done by 10.</p><h3>Lo-Pen (X)</h3><p>Multiplies target's protection by the lo-pen value.</p><h3>One Use</h3><p>After an attack is made, the quantity of this weapon is reduced by one. Useful for grenades or other weapons which have a single use.</p><h3>Protection (X)</h3><p>Provides armour to the Traveller whilst the weapon is active. This stacks with all other types of armour. Provided by some types of shields.</p><h3>Radiation</h3><p>Does radiation damage. This will be listed in the damage output, and applied to Travellers when the damage is dragged to their sheet.</p><h3>PSI AP (X)</h3><p>The AP of the weapon is equal to the PSI DM of the wielder times X. Extra PSI points can be spent to increase the AP by X.</p><h3>Psi Damage (X)</h3><p>If PSI DM is greater than zero, then this multiplied by X is added as a damage bonus. This is in addition to any damage bonus from STR.</p><p>Psi Points can be spent to increase damage, each point does a further X damage.</p><p>Note that the behaviour of Psi Damage &gt; 1 has been extrapolated from the rules for Psi AP.</p><h3>Shield (X)</h3><p>Uses the shield rules. Melee is minimum of the user's weapon skill and the shield skill when making a parry. You should also set the parry score for the weapon. The Shield (X) does not add a parry bonus, it just sets a minimum for the melee skill.</p><p>Most shields have Shield (0) and Parry +1</p><h3>Stun</h3><p>Does stun damage.</p><h3>Very Bulky</h3><p>Gives a penalty to using a weapon is STR is less than 12.</p><p></p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1,
        "XsiBG1ohlPVbUVQC": 3
      },
      "flags": {},
      "_stats": {
        "compendiumSource": null,
        "duplicateSource": null,
        "coreVersion": "12.331",
        "systemId": "mgt2e",
        "systemVersion": "0.12.4.2-DEV",
        "createdTime": 1750105153543,
        "modifiedTime": 1750109997998,
        "lastModifiedBy": "XsiBG1ohlPVbUVQC"
      },
      "_key": "!journal.pages!s8DAOTe8r1s1TE7k.atkiDLVflVo0A6qx"
    },
    {
      "sort": 300000,
      "name": "Computers & Software",
      "type": "text",
      "_id": "2dv8wfQEVIcH06ZD",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<h2>COmputers</h2><p>A Computer is any item that has the Computer option enabled. </p><p>Generic Items, Augments, Armour and Weapons can have computers enabled on them. Once the computer is enabled, the bandwidth capability of the software can be set on a range of 0 to 4.</p><p>Currently, this value is for informational purposes only. No limitations are enforced as to what software can be run on a computer.</p><p>Once an item has an embedded computer enabled, it will also list the software packages that are currently installed on it.</p><h3>Using Computers</h3><p>If a computer has software installed on it, then the list will be displayed, along with the option to make skill checks direct from the computer.</p><p>The type of software package (see below) will determine how these skills are used.</p><p></p><h2>Software</h2><p>Software is a special type of item that can be installed on anything with an embedded computer, or on a spacecraft.</p><p>There are two types of softwrae: Personal and Spacecraft.</p><p>Personal software can be installed onto embedded computers.</p><p>Spacecraft software only runs on a ship's computer.</p><p></p><h3>Software Properties</h3><h4>Interface Type</h4><p>If the software is an interface, then you can set the type of interface it provides. You can select the interface type from the drop down. A computer needs to have an interface installed on it for it to be usable.</p><p>Currently, there is basic enforcement of this. If multiple interfaces are installed on a computer, the best is used.</p><h4>Installed On</h4><p>If a software item is owned by an Actor, then the \"Installed On\" drop down will list all the other items this Actor has that have the ability to run software. Select the one that you want to run this software package on.</p><h4>Software Features</h4><p>The features of the software define what it does. Normally, most software provides the ability to run skills.</p><h5>Generic</h5><p>This software doesn't do anything that is covered by rules automation.</p><h5>Expert Package</h5><p>This is an expert package, and obeys the rules of expert packages. The skill can be rolled from the computer that it is installed on.</p><h5>Skill Augment</h5><p>A skill augment gives a direct bonus to a skill check.</p><h5>Task Skill</h5><p>The computer makes the skill check itself, without any reference to the Actor's own skill.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1,
        "XsiBG1ohlPVbUVQC": 3
      },
      "flags": {},
      "_stats": {
        "compendiumSource": null,
        "duplicateSource": null,
        "coreVersion": "12.331",
        "systemId": "mgt2e",
        "systemVersion": "0.12.5.5-DEV",
        "createdTime": 1752055377493,
        "modifiedTime": 1752056102070,
        "lastModifiedBy": "XsiBG1ohlPVbUVQC"
      },
      "_key": "!journal.pages!s8DAOTe8r1s1TE7k.2dv8wfQEVIcH06ZD"
    }
  ],
  "sort": 250000,
  "ownership": {
    "default": 0,
    "Uzw5MJmM0BRE3sSL": 3
  },
  "flags": {
    "core": {
      "sourceId": "JournalEntry.s8DAOTe8r1s1TE7k"
    }
  },
  "_stats": {
    "systemId": "mgt2e",
    "systemVersion": "0.10.0",
    "coreVersion": "12.329",
    "createdTime": 1717857394561,
    "modifiedTime": 1724487830117,
    "lastModifiedBy": "mhUjqDVicnwIUaiq",
    "compendiumSource": "JournalEntry.s8DAOTe8r1s1TE7k",
    "duplicateSource": null
  },
  "_key": "!journal!s8DAOTe8r1s1TE7k"
}
