{
  "folder": "81lpHPvcOeOkc8gf",
  "name": "Items",
  "_id": "s8DAOTe8r1s1TE7k",
  "pages": [
    {
      "sort": 100000,
      "name": "Items",
      "type": "text",
      "_id": "3cfgP1fZ6XPrvCmF",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>There are multiple types of items.</p><p></p><h1>Carried Items</h1><p>These are physical items that can be carried by Travellers and NPCs. They have a weight and to an actor's encumbrance.</p><p>Each carried item has a Tech Level, Cost and Weight.</p><p>Such items have three possible states on the actor sheet:</p><p><strong>Active</strong> - Worn or held in the hand. These are ready to be used.</p><p><strong>Carried</strong> - Being carried, but not in use.</p><p><strong>Stored</strong> - These are owned by the Traveller, but not currently 'at hand'.</p><p></p><p></p><h2>Weapon</h2><p>Weapons appear in the list of attack items. Weapons have a scale, which is either Traveller, Vehicle or Starship. This affects what type of actor can use it.</p><p>Weapons can have traits, which may have an effect on the attack. The following traits are currently supported:</p><p><strong>AP</strong>, <strong>Auto</strong>, <strong>Blast</strong>, <strong>Bulky</strong>, Destructive, LaserSight, <strong>Lo-Pen</strong>, <strong>Radiation</strong>, Scope, Smart, <strong>Stun</strong>, <strong>VeryBulky</strong>, Zero-G</p><p>The ones listed in bold have automated support. The others are currently just informational.</p><h2>Armour</h2><p>Armour adds a to an actor's ability to resist damage. Normally, only one item or armour can be worn at a time. Wearing an item of armour when one is already being worn will move the other to 'carried'.</p><p>Armour has a protection and a 'other protection' score. The latter is added to the base protection if the attack type of the weapon (laser, energy, fire) matches one of the energy types listed for the armour.</p><p></p><h2>Augmentation</h2><p>Augmentations give bonuses to an actor, in the form of bonuses to characteristics or skills. They are normally cyberware or biological implants or drugs. There are several types, which vary by how they add bonuses.</p><h3>Skill and Characteristic Effects</h3><p><strong>Augment</strong> - Increases a characteristic or skill by the given value. The character must already have the skill at 0 for an augment to work.</p><p><strong>DM</strong> - Adds a bonus or penalty to rolls involving the characteristic or skill. The bonus applies regardless of the skill level of the character.</p><p><strong>Boon / Bane</strong> - Causes rolls for this characteristic or skill to be rolled with a boon or a bane.</p><p><strong>Expert Program</strong> - Follows the rules of expert software. Level X gives a skill level of X-1.</p><p><strong>Min</strong> - Sets the minimum value for a characteristic. Applied after Augment bonus.</p><h3>Other Effects</h3><p><strong>Carry Multiplier</strong> - Increases the multiple of how much the character can carry. A value of +1 will double max load (x1 -&gt; x2).</p><p><strong>Encumbrance DM</strong> - Usually a penalty, applied to all physical skill checks.</p><p><strong>Physical DM</strong> - Applied to physical skill checks</p><p><strong>Melee DM</strong> - Applied to attacks with Melee skills. It does not apply to pure skill checks.</p><p><strong>Gun Combat DM</strong> - Provides a bonus to gun skills when making an attack. It does not apply to pure skill checks.</p><p></p><p></p><p></p><h3>General Items</h3><p>Everything else. General Items don't have any game effect other than having a weight and cost.</p><p></p><h1>Spacecraft Items</h1><p></p><h2>Cargo</h2><p>Freight which can be traded and sold. Cargo can have purchase and sale DMs applied to it, which is not currently used. There are plans to implement the trade system, at which point these will become useful.</p><p>Cargo can only be added to spacecraft actor sheets.</p><p></p><h2>Hardware</h2><p>Spacecraft hardware, such as jump drives, weapons and power systems. Hardware can only be added to spacecraft actor sheets.</p><p></p><h1>Meta Items</h1><p>Such items represent things on the character sheet, but aren't physical things in the world.</p><p></p><h2>Term</h2><p>A career term during character generation.</p><p></p><h2>Associate</h2><p>An ally, enemy, contact or rival that is gained during character generation.</p><p></p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1,
        "Uzw5MJmM0BRE3sSL": 3
      },
      "flags": {},
      "_stats": {
        "systemId": "mgt2e",
        "systemVersion": "0.10.0",
        "coreVersion": "12.331",
        "createdTime": 1717860730537,
        "modifiedTime": 1744478165595,
        "lastModifiedBy": "mhUjqDVicnwIUaiq",
        "compendiumSource": null,
        "duplicateSource": null
      },
      "_key": "!journal.pages!s8DAOTe8r1s1TE7k.3cfgP1fZ6XPrvCmF"
    }
  ],
  "sort": 250000,
  "ownership": {
    "default": 0,
    "Uzw5MJmM0BRE3sSL": 3
  },
  "flags": {
    "core": {
      "sourceId": "JournalEntry.s8DAOTe8r1s1TE7k"
    }
  },
  "_stats": {
    "systemId": "mgt2e",
    "systemVersion": "0.10.0",
    "coreVersion": "12.329",
    "createdTime": 1717857394561,
    "modifiedTime": 1724487830117,
    "lastModifiedBy": "mhUjqDVicnwIUaiq",
    "compendiumSource": "JournalEntry.s8DAOTe8r1s1TE7k",
    "duplicateSource": null
  },
  "_key": "!journal!s8DAOTe8r1s1TE7k"
}
