{
  "folder": "81lpHPvcOeOkc8gf",
  "name": "Spacecraft",
  "_id": "XqtcLHYC383iXuNo",
  "pages": [
    {
      "sort": 100000,
      "name": "Crew Roles",
      "type": "text",
      "_id": "M6w2juT3bwCbEXdU",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>Travellers and NPCs can be dragged onto a spacecraft to assign them as passengers. They can then be promoted to crew members.</p><p>Each crew member can be granted one or more roles. A role allows the crew member to perform actions directly from the spacecraft sheet, with predefined difficulties and modifiers.</p><h2>Creating a Role</h2><p>To create a new role, create a \"Crew Role\" item, and give it a name. Actions can then be added to the role depending on what you want the role to do.</p><h3>Chat</h3><p>A chat action will simply output a message to the chat. This can be used for describing actions or flavour text.</p><h3>Skill</h3><p>A skill action will make a skill check using the crew member's own skills. You can select the skill to be rolled, along with optionally specificying a characteristic to use (otherwise the character's default will be used for that skill).</p><p>You can set a skill target number (defaults to 8) and specify a DM to apply to the check. Specifying a target of 6 or adding a DM of +2 have much the same effect, but conceptually they can be different.</p><p>A Jump astrogation check is dificulty 4, with a -1 DM per parsec of distance, so you could either specify a target of 5 for a 1 parsec jump, or set the target to 4 with a DM of -1.</p><h3>Weapon</h3><p>You can assign a weapon to be fired. This requires selecting a weapon from the ship, so until the role is applied to the ship weapon attacks can't be set up.</p><p>For a role assigned to a ship, you will be given a list of weapon mounts to select from.</p><h2>Assign Role to Ship</h2><p>Dragging the crew role item to a ship will add it to the list of available roles. These are listed on the Notes tab of the spacecraft's sheet.</p><p>A role can be edited or deleted from this tab.</p><h2>Assign Role to Crew</h2><p>To assign a role to a crew member, go to the Crew tab and edit a crew member. You will be given a list of available roles to select from. A crew member can have multiple roles assigned to them.</p><p>Once a role is assigned, a button for each task will appear on that crew member's entry. Click it to perform the action.</p><p></p><p></p><p></p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1,
        "mhUjqDVicnwIUaiq": 3
      },
      "flags": {},
      "_stats": {
        "systemId": "mgt2e",
        "systemVersion": "0.10.1",
        "coreVersion": "13.348",
        "createdTime": 1725187463182,
        "modifiedTime": 1725188117952,
        "lastModifiedBy": "mhUjqDVicnwIUaiq",
        "compendiumSource": null,
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!XqtcLHYC383iXuNo.M6w2juT3bwCbEXdU"
    },
    {
      "sort": 200000,
      "name": "Spacecraft Weapons",
      "type": "text",
      "_id": "qLZ9BdVEeSIbwc57",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>Adding weapons to a spacecraft is a four step process. </p><ol><li><p>Add a spacecraft scale weapon to the ship.</p></li><li><p>Create a mount point for the weapon.</p></li><li><p>Assign the weapon to the mount.</p></li><li><p>Assign a role to a crew member to fire the weapon.</p></li></ol><h2>Add Weapon to Spacecraft</h2><p>If a Weapon item with a scale of 'Spacecraft' is dragged onto the ship's sheet, then it will be made available for adding to mount points. A weapon can be assigned to multiple mounts, so you only need to add one of each weapon type.</p><p>The full list of available weapons is displayed in the Notes tab of a spacecraft's sheet.</p><h2>Create a Mount</h2><p>Add a hardware item of type Weapon. This creates a weapon mounting (such as a turret, bay or spinal mount) which can have a weapon assigned to it.</p><p>Weapon mounts appear in the Hardware tab of a spacecraft.</p><h2>Assign Weapon to Mount</h2><p>If you edit the weapon mount, then you should see a list of available weapons that can be assigned to that weapon. Weapons need to have the same mounting type. So a Small Bay weapon mount will only display weapons with a mount type of Small Bay.</p><p>You can normally add only a single weapon to a mount. The exception is for double, triple and quad turrets that allow multiple weapons to be assigned (or the same weapon to be assigned multiple times).</p><p>You can increase the quantity of weapon mounts, which means that there are multiple different turrets or bays with that type of weapon.</p><h2>Assign a Role</h2><p>Once a weapon has been setup and added to a mount, you can then assign that weapon to the 'Weapon' task in a crew role.</p><p></p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1,
        "mhUjqDVicnwIUaiq": 3
      },
      "flags": {},
      "_stats": {
        "systemId": "mgt2e",
        "systemVersion": "0.10.1",
        "coreVersion": "13.348",
        "createdTime": 1725188139416,
        "modifiedTime": 1725188403553,
        "lastModifiedBy": "mhUjqDVicnwIUaiq",
        "compendiumSource": null,
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!XqtcLHYC383iXuNo.qLZ9BdVEeSIbwc57"
    },
    {
      "sort": 0,
      "name": "Hardware",
      "type": "text",
      "_id": "f7qCCfDWJowPIoUW",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>Hardware is core to the design of a spacecraft. Hardware are items which provide reactors, manouevre drives, jump drives, cargo, bridges and computers for a spacecraft.</p><p>In order to configure a spacecraft beyond the basic hull, you need to add hardware.</p><img src=\"systems/mgt2e/images/docs/spacecraft_hardware.webp\" /><p></p><p>In the hardware tab, it is possible to add basic hardware types using the 'Add Hardware' menu. Other types of hardware will need to be defined and dropped in from elsewhere.</p><p>The statistics at the top of the sheet for things such as cargo space, J-Drive and M-Drive rating etc will be automatically set once the hardware items have been added.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1,
        "mhUjqDVicnwIUaiq": 3
      },
      "flags": {},
      "_stats": {
        "compendiumSource": null,
        "duplicateSource": null,
        "coreVersion": "13.348",
        "systemId": "mgt2e",
        "systemVersion": "0.11.0",
        "createdTime": 1732398979588,
        "modifiedTime": 1732402331404,
        "lastModifiedBy": "mhUjqDVicnwIUaiq",
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!XqtcLHYC383iXuNo.f7qCCfDWJowPIoUW"
    },
    {
      "sort": 300000,
      "name": "Hardware Tonnage",
      "type": "text",
      "_id": "QSbX50dfCitPnl0G",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>Tonnage for general system items can be calculated in a variety of ways.</p><p>Legacy versions (up to 0.13.5) only supported `pcByRating`. Since 0.14 there are a number of different options. These options are only provided for the <strong>General</strong> hardware type. Other hardware types have their own specific means of calculating tonnage, power and cost.</p><h2>Common Values</h2><h4>Top Section</h4><p><strong>Cost (MCr):</strong> The final calculated value of the item.</p><p><strong>Rating:</strong> A value that can be assigned to the item. What this represents depends on the item in question. It's just meant as a way to scale the capability of the item.</p><p><strong>TONS:</strong> The final calculated Tonnage of the item.</p><h4>Sidebar</h4><p><strong>POWER:</strong> The final calculated Power consumption of the item.</p><p></p><img src=\"systems/mgt2e/images/docs/general_hardware.webp\" /><p></p><h2>Calculation</h2><p>For general items, the Cost, TONs and Power is calculated based on a number of factors.</p><p>Note that there is a <strong>Base TONS</strong> and a <strong>Minimum TONS</strong>. The base tons is added to the calculated tonnage of the item. If an item up takes up 10% of the hull, plus 5 tons, then set Base TONS to 5. For a 200t ship, the total would be 20t (10%) + 5 tons = 25 tons.</p><p>The Minimum TONs is the smallest this item can be. Some items have a minimum size. This is applied after other tonnage calculations.</p><p></p><h3>Tonnage</h3><h4>%/Rating</h4><p>The item takes up tonnage equal to the rating of the item multiplied by the percentage of the hull. Setting this to 10, and setting the Rating to 3 on a 100t ship, means the item will take up 30%, or 30t.</p><h4>% Hull</h4><p>The item takes up a given percentage of the total hull tonnage. Setting this to 40 on a 200t ship, means the item will take up 80 tons.</p><h4>Tons/Rating</h4><p>The item takes up a number of tons for each rating of the item.</p><h4>Fixed Tons</h4><p>The item takes up a fixed number of tons that never changes. In this case, just set Base TONS to the required value.</p><p></p><h3>Cost</h3><h4>Item TON</h4><p>The cost is per TON of the item.</p><h4>Hull TON</h4><p>The cost is per TON of the ship hull.</p><h4>Rating TON</h4><p>The cost is per Rating assigned to the item.</p><h4>Fixed Cost</h4><p>The cost is a fixed value which never changes.</p><p></p><h3>Power</h3><h4>Item TONs</h4><p>The Power consumption is per TON of the item.</p><h4>Hull TONs</h4><p>The Power consumption is per TON of the ship hull.</p><h4>Rating</h4><p>The Power consumption is per Rating of the item.</p><h4>Fixed Power</h4><p>The Power is a fixed value which never changes.</p><p></p><p></p><p></p><p></p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1,
        "XsiBG1ohlPVbUVQC": 3
      },
      "flags": {},
      "_stats": {
        "compendiumSource": null,
        "duplicateSource": null,
        "coreVersion": "13.348",
        "systemId": "mgt2e",
        "systemVersion": "0.13.5.2-DEV",
        "createdTime": 1754927321718,
        "modifiedTime": 1755270570474,
        "lastModifiedBy": "mhUjqDVicnwIUaiq",
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!XqtcLHYC383iXuNo.QSbX50dfCitPnl0G"
    }
  ],
  "sort": 500000,
  "ownership": {
    "default": 0,
    "mhUjqDVicnwIUaiq": 3
  },
  "flags": {},
  "_stats": {
    "systemId": "mgt2e",
    "systemVersion": "0.10.1",
    "coreVersion": "13.348",
    "createdTime": 1725187432135,
    "modifiedTime": 1725188403553,
    "lastModifiedBy": "mhUjqDVicnwIUaiq",
    "compendiumSource": null,
    "duplicateSource": null,
    "exportSource": null
  },
  "categories": [],
  "_key": "!journal!XqtcLHYC383iXuNo"
}
